iarsystems/ewarm-nxp-example-projects/LPC11xx/IAR-LPC-11A14-SK/simple/i2c/i2c.c
/****************************************************************************
 *   $Id: i2c.c 28 2014-01-27 14:45:13Z danielru $
 *   Project: NXP LPC11Axx I2C example
 *
 *   Description:
 *     This file contains I2C code example which include I2C initialization,
 *     I2C interrupt handler, and APIs for I2C access.
 *
 ****************************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.

* Permission to use, copy, modify, and distribute this software and its
* documentation is hereby granted, under NXP Semiconductors’
* relevant copyright in the software, without fee, provided that it
* is used in conjunction with NXP Semiconductors microcontrollers.  This
* copyright, permission, and disclaimer notice must appear in all copies of
* this code.

****************************************************************************/

#include "LPC11Axx.h"     /* LPC11Axx Peripheral Registers */
#include "type.h"
#include "i2c.h"

volatile uint32_t I2CMasterState = I2C_IDLE;
volatile uint32_t I2CSlaveState = I2C_IDLE;
volatile uint32_t timeout = 0;

volatile uint32_t I2CMode;

volatile uint8_t I2CMasterBuffer[BUFSIZE];
volatile uint8_t I2CSlaveBuffer[BUFSIZE];
volatile uint32_t I2CCount = 0;
volatile uint32_t I2CReadLength;
volatile uint32_t I2CWriteLength;

volatile uint32_t RdIndex = 0;
volatile uint32_t WrIndex = 0;

/*
From device to device, the I2C communication protocol may vary,
in the example below, the protocol uses repeated start to read data from or
write to the device:
For master read: the sequence is: STA,Addr(W),offset,RE-STA,Addr(r),data...STO
for master write: the sequence is: STA,Addr(W),offset,RE-STA,Addr(w),data...STO
Thus, in state 8, the address is always WRITE. in state 10, the address could
be READ or WRITE depending on the I2C command.
*/

/*****************************************************************************
** Function name:   I2C_IRQHandler
**
** Descriptions:    I2C interrupt handler, deal with master mode only.
**
** parameters:      None
** Returned value:    None
**
*****************************************************************************/
void I2C_IRQHandler(void)
{
  uint8_t StatValue;

  timeout = 0;
  /* this handler deals with master read and master write only */
  StatValue = LPC_I2C->STAT;
  switch ( StatValue )
  {
  case 0x08:      /* A Start condition is issued. */
  WrIndex = 0;
  LPC_I2C->DAT = I2CMasterBuffer[WrIndex++];
  LPC_I2C->CONCLR = (I2CONCLR_SIC | I2CONCLR_STAC);
  break;

  case 0x10:      /* A repeated started is issued */
  RdIndex = 0;
  /* Send SLA with R bit set, */
  LPC_I2C->DAT = I2CMasterBuffer[WrIndex++];
  LPC_I2C->CONCLR = (I2CONCLR_SIC | I2CONCLR_STAC);
  break;

  case 0x18:      /* Regardless, it's a ACK */
  if ( I2CWriteLength == 1 )
  {
    LPC_I2C->CONSET = I2CONSET_STO;      /* Set Stop flag */
    I2CMasterState = I2C_NO_DATA;
  }
  else
  {
    LPC_I2C->DAT = I2CMasterBuffer[WrIndex++];
  }
  LPC_I2C->CONCLR = I2CONCLR_SIC;
  break;

  case 0x28:  /* Data byte has been transmitted, regardless ACK or NACK */
  if ( WrIndex < I2CWriteLength )
  {
    LPC_I2C->DAT = I2CMasterBuffer[WrIndex++]; /* this should be the last one */
  }
  else
  {
    if ( I2CReadLength != 0 )
    {
    LPC_I2C->CONSET = I2CONSET_STA; /* Set Repeated-start flag */
    }
    else
    {
    LPC_I2C->CONSET = I2CONSET_STO;      /* Set Stop flag */
    I2CMasterState = I2C_OK;
    }
  }
  LPC_I2C->CONCLR = I2CONCLR_SIC;
  break;

  case 0x30:
  LPC_I2C->CONSET = I2CONSET_STO;      /* Set Stop flag */
  I2CMasterState = I2C_NACK_ON_DATA;
  LPC_I2C->CONCLR = I2CONCLR_SIC;
  break;

  case 0x40:  /* Master Receive, SLA_R has been sent */
  if ( (RdIndex + 1) < I2CReadLength )
  {
    /* Will go to State 0x50 */
    LPC_I2C->CONSET = I2CONSET_AA;  /* assert ACK after data is received */
  }
  else
  {
    /* Will go to State 0x58 */
    LPC_I2C->CONCLR = I2CONCLR_AAC; /* assert NACK after data is received */
  }
  LPC_I2C->CONCLR = I2CONCLR_SIC;
  break;

  case 0x50:  /* Data byte has been received, regardless following ACK or NACK */
  I2CSlaveBuffer[RdIndex++] = LPC_I2C->DAT;
  if ( (RdIndex + 1) < I2CReadLength )
  {
    LPC_I2C->CONSET = I2CONSET_AA;  /* assert ACK after data is received */
  }
  else
  {
    LPC_I2C->CONCLR = I2CONCLR_AAC; /* assert NACK on last byte */
  }
  LPC_I2C->CONCLR = I2CONCLR_SIC;
  break;

  case 0x58:
  I2CSlaveBuffer[RdIndex++] = LPC_I2C->DAT;
  I2CMasterState = I2C_OK;
  LPC_I2C->CONSET = I2CONSET_STO; /* Set Stop flag */
  LPC_I2C->CONCLR = I2CONCLR_SIC; /* Clear SI flag */
  break;

  case 0x20:    /* regardless, it's a NACK */
  case 0x48:
  LPC_I2C->CONSET = I2CONSET_STO;      /* Set Stop flag */
  I2CMasterState = I2C_NACK_ON_ADDRESS;
  LPC_I2C->CONCLR = I2CONCLR_SIC;
  break;

  case 0x38:    /* Arbitration lost, in this example, we don't
          deal with multiple master situation */
  default:
  I2CMasterState = I2C_ARBITRATION_LOST;
  LPC_I2C->CONCLR = I2CONCLR_SIC;
  break;
  }
  return;
}

/*****************************************************************************
** Function name:   I2CStart
**
** Descriptions:    Create I2C start condition, a timeout
**        value is set if the I2C never gets started,
**        and timed out. It's a fatal error.
**
** parameters:      None
** Returned value:    true or false, return false if timed out
**
*****************************************************************************/
uint32_t I2CStart( void )
{
  uint32_t timeout = 0;
  uint32_t retVal = FALSE;

  /*--- Issue a start condition ---*/
  LPC_I2C->CONSET = I2CONSET_STA; /* Set Start flag */

  /*--- Wait until START transmitted ---*/
  while( 1 )
  {
  if ( I2CMasterState == I2C_STARTED )
  {
    retVal = TRUE;
    break;
  }
  if ( timeout >= MAX_TIMEOUT )
  {
    retVal = FALSE;
    break;
  }
  timeout++;
  }
  return( retVal );
}

/*****************************************************************************
** Function name:   I2CStop
**
** Descriptions:    Set the I2C stop condition, if the routine
**        never exit, it's a fatal bus error.
**
** parameters:      None
** Returned value:    true or never return
**
*****************************************************************************/
uint32_t I2CStop( void )
{
  LPC_I2C->CONSET = I2CONSET_STO;      /* Set Stop flag */
  LPC_I2C->CONCLR = I2CONCLR_SIC;  /* Clear SI flag */

  /*--- Wait for STOP detected ---*/
  while( LPC_I2C->CONSET & I2CONSET_STO );
  return TRUE;
}

/*****************************************************************************
** Function name:   I2CInit
**
** Descriptions:    Initialize I2C controller
**
** parameters:      I2c mode is either MASTER or SLAVE
** Returned value:    true or false, return false if the I2C
**        interrupt handler was not installed correctly
**
*****************************************************************************/
uint32_t I2CInit( uint32_t I2cMode )
{
  LPC_SYSCON->PRESETCTRL |= (0x1<<1);

  LPC_SYSCON->SYSAHBCLKCTRL |= (1<<5);
#if 1
  LPC_IOCON->PIO0_2 &= ~0x3F; /*  I2C I/O config */
  LPC_IOCON->PIO0_2 |= 0x01;    /* I2C SCL */
  LPC_IOCON->PIO0_3 &= ~0x3F;
  LPC_IOCON->PIO0_3 |= 0x01;    /* I2C SDA */
  LPC_IOCON->PIO0_2 |= (0x1<<10); /* open drain pins */
  LPC_IOCON->PIO0_3 |= (0x1<<10); /* open drain pins */
#endif
#if 0
  LPC_IOCON->PIO0_12 &= ~0x3F;  /*  I2C I/O config */
  LPC_IOCON->PIO0_12 |= 0x04;   /* I2C SCL */
  LPC_IOCON->PIO0_13 &= ~0x3F;
  LPC_IOCON->PIO0_13 |= 0x04;   /* I2C SDA */
  LPC_IOCON->PIO0_12 |= (0x1<<10);  /* open drain pins */
  LPC_IOCON->PIO0_13 |= (0x1<<10);  /* open drain pins */
#endif
#if 0
  LPC_IOCON->PIO0_16 &= ~0x3F;  /*  I2C I/O config */
  LPC_IOCON->PIO0_16 |= 0x04;   /* I2C SCL */
  LPC_IOCON->PIO0_15 &= ~0x3F;
  LPC_IOCON->PIO0_15 |= 0x04;   /* I2C SDA */
  LPC_IOCON->PIO0_16 |= (0x1<<10);  /* open drain pins */
  LPC_IOCON->PIO0_15 |= (0x1<<10);  /* open drain pins */
#endif
#if 0
  LPC_IOCON->PIO0_24 &= ~0x3F;  /*  I2C I/O config */
  LPC_IOCON->PIO0_24 |= 0x01;   /* I2C SCL */
  LPC_IOCON->PIO0_25 &= ~0x3F;
  LPC_IOCON->PIO0_25 |= 0x01;   /* I2C SDA */
  LPC_IOCON->PIO0_24 |= (0x1<<10);  /* open drain pins */
  LPC_IOCON->PIO0_25 |= (0x1<<10);  /* open drain pins */
#endif
  /*--- Clear flags ---*/
  LPC_I2C->CONCLR = I2CONCLR_AAC | I2CONCLR_SIC | I2CONCLR_STAC | I2CONCLR_I2ENC;

  /*--- Reset registers ---*/
#if FAST_MODE_PLUS
  LPC_I2C->SCLL   = I2SCLL_HS_SCLL;
  LPC_I2C->SCLH   = I2SCLH_HS_SCLH;
#else
  LPC_I2C->SCLL   = I2SCLL_SCLL;
  LPC_I2C->SCLH   = I2SCLH_SCLH;
#endif

  if ( I2cMode == I2CSLAVE )
  {
  LPC_I2C->ADR0 = PCF8594_ADDR;
  }

  /* Enable the I2C Interrupt */
  NVIC_EnableIRQ(I2C_IRQn);

  LPC_I2C->CONSET = I2CONSET_I2EN;
  return( TRUE );
}

/*****************************************************************************
** Function name:   I2CEngine
**
** Descriptions:    The routine to complete a I2C transaction
**        from start to stop. All the intermitten
**        steps are handled in the interrupt handler.
**        Before this routine is called, the read
**        length, write length, I2C master buffer,
**        and I2C command fields need to be filled.
**        see i2cmst.c for more details.
**
** parameters:      None
** Returned value:    true or false, return false only if the
**        start condition can never be generated and
**        timed out.
**
*****************************************************************************/
uint32_t I2CEngine( void )
{
  RdIndex = 0;
  WrIndex = 0;

  /*--- Issue a start condition ---*/
  LPC_I2C->CONSET = I2CONSET_STA; /* Set Start flag */

  I2CMasterState = I2C_BUSY;

  while ( I2CMasterState == I2C_BUSY )
  {
  if ( timeout >= MAX_TIMEOUT )
  {
    I2CMasterState = I2C_TIME_OUT;
    break;
  }
  timeout++;
  }
  LPC_I2C->CONCLR = I2CONCLR_STAC;

  return ( I2CMasterState );
}

/******************************************************************************
**                            End Of File
******************************************************************************/

